#ifndef __BURIED_ITEM_DEFINE__
#define	__BURIED_ITEM_DEFINE__

namespace BURIED 
{
	// 할당 받은 command  ( 9005 ~ 9009 ) 
	enum
	{
		REQUEST_PROBE_AREA		= 9005,			// 지역 탐사 요청 		
		RESPONSE_PROBE_AREA						// 지역 탐사 결과를 알린다 
	};


//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 매장된 아이템 정보 
//-----------------------------------------------------------------------------------------------------------------------
typedef struct __ITEMINFO 
{
	DWORD	itemCode;							// 아이템 코드 
	DWORD	mapIndex;							// 아이템이 매장된 맵의 인덱스 
	DWORD	findProbability;					// 발견 확률 

}ITEMINFO;



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 지역 탐사를 요청 한다 
//-----------------------------------------------------------------------------------------------------------------------
typedef struct __sRequestProbeArea
{
	DWORD	command;
	
}sRequestProbeArea;


//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 지역 탐사 결과를 알린다 
//-----------------------------------------------------------------------------------------------------------------------
typedef struct __sResponseProbeArea
{
	DWORD	command;
	
	DWORD	foundItem;						    // 발견한 아이템 

}sResponseProbeArea;

};
#endif 