/************************************************************************************************
	파일명 : OnlineBaseMap.cpp
	담당자 : 이윤석

	Map의 기본형 Class, Map 이 가지는 기본적인 정보들을 가지고 있다.
************************************************************************************************/
#include <GSL.h>
#include "OnlineBaseMap.h"


//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//	설명	:	생성자.
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
OnlineBaseMap::OnlineBaseMap()
{
	m_siXsize		=	0;
	m_siYsize		=	0;
}

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//	설명	:	소멸자.
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
OnlineBaseMap::~OnlineBaseMap()
{
	
}

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//	설명	:	해당 Map X,Y가 Map의 크기를 벗어나지 않는지 검사한다.
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
BOOL	OnlineBaseMap::IsInMapArea(SI32 siX, SI32 siY)
{
	if(((siX < 0) || (siX >=m_siXsize)) ||  ((siY < 0) || (siY >= m_siYsize)))
	   return FALSE;

	return TRUE;
}

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//	설명	:	충돌 타일인지 알아온다.
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
BOOL	OnlineBaseMap::IsColl(SI32 siAtb)
{
	if(siAtb & ON_TILE_ATB_COLL)
		return TRUE;
	else
		return FALSE;
}

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//	설명	:	충돌 타일인지 알아온다.
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
BOOL	OnlineBaseMap::IsColl(SI32 siAtb, SI32 siTileKind, SI32 siCharMoveableTileKind)
{
	// 그 타일이 충돌 속성이 포함되어 있다면 무조건 충돌 타일이다.
	if(siAtb & ON_TILE_ATB_COLL)							return TRUE;
	else
	{
		// 그 캐릭터의 속성에 따라서 그 타일이 충돌 되는지 판단한다.
		if((siTileKind & siCharMoveableTileKind) == 0)		return TRUE;
		else												return FALSE;
	}
}
