#ifndef  __MCICDP_H
#define __MCICDP_H

#include <windows.h>
#include <Directives.h>

//--------------------------------------------------------------------------
// Name: CDAudioInitial()
// Desc: CD ROM DRIVE를 초기화 한다.
//--------------------------------------------------------------------------
BOOL CDAudioInitial(HWND hwnd);

//--------------------------------------------------------------------------
// Name: CDAudioShutdown()
// Desc: CD ROM DRIVE Audio를 종료한다.
//--------------------------------------------------------------------------
BOOL CDAudioShutdown(void);

//--------------------------------------------------------------------------
// Name: CDAudio_Eject()
// Desc: CD-ROM DRIVE의 Tray를 Open한다.
//--------------------------------------------------------------------------
BOOL CDAudioEject(void);

//--------------------------------------------------------------------------
// Name: CDAudioCloseDoor()
// Desc: CD-ROM DRIVE의 Tray를 Close한다. 
//--------------------------------------------------------------------------
BOOL CDAudioCloseDoor(void);

//--------------------------------------------------------------------------
// Name: CDAudioGetAudioDiskInfo()
// Desc: CD-ROM 의 Audio Disk의 정보를 얻어온다.
//--------------------------------------------------------------------------
BOOL CDAudioGetAudioDiskInfo(void);

//--------------------------------------------------------------------------
// Name: CDAudioPlayL()
// Desc: 2번째 트랙부터 반복 연주를 시작한다.
//--------------------------------------------------------------------------
BOOL CDAudioPlayL(void);

//--------------------------------------------------------------------------
// Name: CDAudioPlay()
// Desc: CD Audio Track을 연주 한다. 
//--------------------------------------------------------------------------
BOOL CDAudioPlay(UI32 uiTrack, BOOL bLooping);

//--------------------------------------------------------------------------
// Name: CDAudioPlayLFrom()
// Desc: 원하는 CD Audio Track부터 반복 연주 한다. 
//--------------------------------------------------------------------------
BOOL CDAudioPlayLFrom(UI32 uiTrack);

//--------------------------------------------------------------------------
// Name: CDAudioPlayFrom()
// Desc: 음악연주를 StartTrack 부터 끝까지 연주한다.
//--------------------------------------------------------------------------
BOOL CDAudioPlayFrom(UI32 uiStartTrack, BOOL bLooping);

//--------------------------------------------------------------------------
// Name: 
// Desc: PlayCDFromAndTo()함수는 음악연주를 StartTrack 부터 EndTrack까지 연주한다.
//--------------------------------------------------------------------------
BOOL CDAudioPlayFromAndTo(UI32 StartTrack, UI32 EndTrack, BOOL bLooping);

//--------------------------------------------------------------------------
// Name: CDAudioStop()
// Desc: CD Audio Track연주를 중지한다.
//--------------------------------------------------------------------------
BOOL CDAudioStop(void);

//--------------------------------------------------------------------------
// Name: CDAudioPause()
// Desc: CD 연주를 잠시 중단 시킨다.
//--------------------------------------------------------------------------
BOOL CDAudioPause(void);

//--------------------------------------------------------------------------
// Name: CDAudioResume()
// Desc: 잠시 Pause 시킨 연주를 계속 재개한다.
//--------------------------------------------------------------------------
BOOL CDAudioResume(void);
//--------------------------------------------------------------------------
// Name: CDFunction()
// Desc: CD Audio의 각 기능을 한다.
//--------------------------------------------------------------------------
BOOL CDFunction(UI32 Command, UI32 uiParam);

//--------------------------------------------------------------------------
// Name: 
// Desc: Window Procedure에서 처리한다.
//--------------------------------------------------------------------------
BOOL CDAudioMessageHandler(HWND hWnd, UINT uMsg, WPARAM wParam, LPARAM lParam);

//--------------------------------------------------------------------------
// Name: CDAudioGetCurrentCDTrack()
// Desc: 함수는 현재의 트랙위치를 알아낸다.
//--------------------------------------------------------------------------
DWORD CDAudioGetCurrentCDTrack(void);

#endif
