#include "SOMain.h"
#include "PlayerList.h"
#include "SOPlayer.h"



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 
//-----------------------------------------------------------------------------------------------------------------------
CPlayerList::CPlayerList(int maxPlayer): MAX_PLAYER(maxPlayer), m_numPlayer(0)
{
	int i;

	m_PlayerList = new SOPlayer* [ MAX_PLAYER ];

	for(i = 0; i < MAX_PLAYER; ++i)
	{
		m_PlayerList[i] = NULL;
	}

//	clear();
}



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 
//-----------------------------------------------------------------------------------------------------------------------
CPlayerList::~CPlayerList() 
{
	if(m_PlayerList) delete m_PlayerList;
}



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 플레이어 리스트에 추가 
//-----------------------------------------------------------------------------------------------------------------------
bool CPlayerList::add(SOPlayer* pPlayer)
{	
	if( pPlayer == NULL) return FALSE;

	// 이미 플레이어가 목록에 있다면 제거한다 (순서유지를 위해)
	remove(pPlayer);

	if( m_numPlayer < MAX_PLAYER )
	{
		m_PlayerList[m_numPlayer] = pPlayer;

		++m_numPlayer;

		return TRUE;
	}

	return FALSE;
}



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 플레이어 리스트에서 삭제 
//-----------------------------------------------------------------------------------------------------------------------
void CPlayerList::remove(SOPlayer* pPlayer)
{
	if( pPlayer == NULL) return;

	for(int i=0; i < m_numPlayer; ++i)
	{
		if( m_PlayerList[i] == pPlayer ) 
		{
			int size = sizeof(m_PlayerList[0]) *  ( m_numPlayer -  i - 1 );

			if( size > 0 )
			memcpy( &m_PlayerList[i], &m_PlayerList[i+1],  size );

			--m_numPlayer;
			
			return;
		}
	}
}



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 플레이어 리스트 초기화 
//-----------------------------------------------------------------------------------------------------------------------
void CPlayerList::clear()
{
	for(int i=0; i < m_numPlayer; ++i)
	{
		m_PlayerList[i] = NULL;
	}

	m_numPlayer = 0;
}



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 
//-----------------------------------------------------------------------------------------------------------------------
SOPlayer* CPlayerList::get(int index)
{
	if(index >= 0 && index < m_numPlayer) return m_PlayerList[index];

	return NULL;
}



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 
//-----------------------------------------------------------------------------------------------------------------------
SOPlayer* CPlayerList::getLast()
{
	if( getNum() > 0 ) return m_PlayerList[ getNum()-1 ];

	return NULL;
}



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 
//-----------------------------------------------------------------------------------------------------------------------
int CPlayerList::getNum()
{
	return m_numPlayer;
}



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 
//-----------------------------------------------------------------------------------------------------------------------
void CPlayerList::write(void* msg, int size)
{
	int		  index = 0;	
	SOPlayer* pPlayer;	


	while( pPlayer = get(index) )
	{		
		pPlayer->Write(msg, size);
		++index;
	}
}



//-----------------------------------------------------------------------------------------------------------------------
//	Name : 
//	Desc : 
//-----------------------------------------------------------------------------------------------------------------------
void CPlayerList::write(void* msg, int size, SOPlayer* pExceptPlayer)
{
	int		  index = 0;	
	SOPlayer* pPlayer;	

	while( pPlayer = get(index) )
	{
		if( pPlayer == pExceptPlayer ) 
		{			
			++index;
			continue;
		}

		pPlayer->Write(msg, size);
		++index;
	}
}



